// Генеруємо випадкове число від 1 до 100, яке користувач повинен вгадати
const targetNumber = Math.floor(Math.random() * 100) + 1;

// Змінна для збереження кількості спроб користувача
let attempts = 0;

// Функція для гри
function guessNumber() {
  // Запитуємо користувача про введення числа
  const userGuess = prompt("Вгадайте число від 1 до 100:");

  // Збільшуємо кількість спроб користувача
  attempts++;

  // Перевіряємо, чи відповідає введене число числу, яке потрібно вгадати
  if (parseInt(userGuess) === targetNumber) {
    console.log(
      `Вітаємо! Ви вгадали число ${targetNumber} за ${attempts} спроб!`
    );
  } else {
    // Якщо введене число не відповідає загаданому числу, продовжуємо гру
    console.log("Неправильно! Спробуйте ще раз.");
    guessNumber();
  }
}

// Починаємо гру
guessNumber();
